# IFCParameter Template Is Valid Parameter Mapping File Property

Source: https://www.revitapidocs.com/2026/0b0f50dc-c76f-4eb0-b108-300caeeb78d6.htm

---

| IFCParameter Template Is Valid Parameter Mapping File Property |
| --- |

Whether or not the parameter mapping file is valid.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public bool IsValidParameterMappingFile { get; set; }
```

```
Public Property IsValidParameterMappingFile As Boolean
	Get
	Set
```

```
public:
property bool IsValidParameterMappingFile {
	bool get ();
	void set (bool value);
}
```

```
member IsValidParameterMappingFile : bool with get, set
```

#### Property Value

Boolean See Also

#### Reference

IFCParameterTemplate Class Autodesk.Revit.DB Namespace